In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1= ({
    'name':['harry','rohan','shatil','shuvo'],
    'marks':[12,34,56,78],
    'city':['Barisal','dhaka','rajshahi','comilla']
})

In [3]:
df= pd.DataFrame(dict1)

In [4]:
df

     name  marks      city
0   harry     12   Barisal
1   rohan     34     dhaka
2  shatil     56  rajshahi
3   shuvo     78   comilla

In [5]:
df.to_csv('friends.csv')

In [6]:
df.to_csv('friends_indexFalse.csv',index=False) # index=row, column=column

In [7]:
df.head(2)

    name  marks     city
0  harry     12  Barisal
1  rohan     34    dhaka

In [8]:
df.tail(2)

     name  marks      city
2  shatil     56  rajshahi
3   shuvo     78   comilla

In [10]:
df.describe()

           marks
count   4.000000
mean   45.000000
std    28.401878
min    12.000000
25%    28.500000
50%    45.000000
75%    61.500000
max    78.000000

In [35]:
train= pd.read_csv('train.csv')

In [36]:
train

   Train number  Speed      City
0          8721     50   Barisal
1           589     34     dhaka
2          2862     56  rajshahi
3          8230     78   comilla

In [37]:
train['Speed']

0    50
1    34
2    56
3    78
Name: Speed, dtype: int64

In [38]:
train['Speed'][0]

50

In [39]:
train['Speed'][0]=58

<ipython-input-39-343277fe5160>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['Speed'][0]=58

In [40]:
train

   Train number  Speed      City
0          8721     58   Barisal
1           589     34     dhaka
2          2862     56  rajshahi
3          8230     78   comilla

In [41]:
train.to_csv('train.csv')

In [43]:
train.index=['first','second','third','fourth'] # row= index

In [44]:
train

        Train number  Speed      City
first           8721     58   Barisal
second           589     34     dhaka
third           2862     56  rajshahi
fourth          8230     78   comilla

In [45]:
ser = pd.Series(np.random.rand(34))

In [46]:
ser

0     0.284276
1     0.987297
2     0.100245
3     0.565203
4     0.114159
5     0.301932
6     0.533423
7     0.701336
8     0.373079
9     0.554994
10    0.796173
11    0.285765
12    0.355624
13    0.944364
14    0.460862
15    0.696932
16    0.597839
17    0.601259
18    0.192753
19    0.436345
20    0.272056
21    0.259081
22    0.887709
23    0.182052
24    0.927894
25    0.155355
26    0.143987
27    0.462830
28    0.508531
29    0.968508
30    0.898041
31    0.921034
32    0.376694
33    0.464804
dtype: float64

In [47]:
type(ser)

pandas.core.series.Series

In [50]:
newdf = pd.DataFrame(np.random.rand(334,5), index= np.arange(334))
# np rand -> row, col

In [51]:
newdf

            0         1         2         3         4
0    0.094507  0.714596  0.115251  0.966280  0.119836
1    0.667360  0.285382  0.320376  0.749366  0.003239
2    0.146307  0.537367  0.366041  0.540916  0.454495
3    0.598608  0.156227  0.214438  0.871918  0.431849
4    0.778260  0.509021  0.821528  0.373929  0.900429
..        ...       ...       ...       ...       ...
329  0.498871  0.617681  0.788718  0.482554  0.982107
330  0.303543  0.209804  0.286465  0.175144  0.751455
331  0.319081  0.820951  0.567303  0.319609  0.133335
332  0.385293  0.039920  0.619125  0.528717  0.829031
333  0.874553  0.403351  0.951871  0.743491  0.417780

[334 rows x 5 columns]

In [52]:
type(newdf)

pandas.core.frame.DataFrame

In [56]:
newdf.head()

          0         1         2         3         4
0  0.094507  0.714596  0.115251  0.966280  0.119836
1  0.667360  0.285382  0.320376  0.749366  0.003239
2  0.146307  0.537367  0.366041  0.540916  0.454495
3  0.598608  0.156227  0.214438  0.871918  0.431849
4  0.778260  0.509021  0.821528  0.373929  0.900429

In [57]:
newdf.tail()

            0         1         2         3         4
329  0.498871  0.617681  0.788718  0.482554  0.982107
330  0.303543  0.209804  0.286465  0.175144  0.751455
331  0.319081  0.820951  0.567303  0.319609  0.133335
332  0.385293  0.039920  0.619125  0.528717  0.829031
333  0.874553  0.403351  0.951871  0.743491  0.417780

In [53]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.516283    0.505901    0.483729    0.488610    0.509108
std      0.280872    0.270101    0.289932    0.283332    0.286965
min      0.001375    0.002897    0.002844    0.014868    0.001465
25%      0.280050    0.268935    0.232810    0.220910    0.278302
50%      0.527926    0.519080    0.466698    0.522492    0.503731
75%      0.760479    0.718096    0.734893    0.731413    0.762608
max      0.996798    0.992412    0.999919    0.995236    0.991004

In [55]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [58]:
newdf[0][0]= 'Shatil'

In [59]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [60]:
newdf.head(3)

          0         1         2         3         4
0    Shatil  0.714596  0.115251  0.966280  0.119836
1   0.66736  0.285382  0.320376  0.749366  0.003239
2  0.146307  0.537367  0.366041  0.540916  0.454495

In [61]:
newdf[0][0]= 0.3

<ipython-input-61-12bed4a96a74>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf[0][0]= 0.3

In [62]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [63]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [64]:
newdf.to_numpy()

array([[0.3, 0.7145958000421787, 0.11525106791087447, 0.9662799293926279,
        0.1198363754644417],
       [0.6673596226532558, 0.2853819855888019, 0.32037581262246795,
        0.7493663764292087, 0.0032394813654749166],
       [0.1463065505886867, 0.537366772148688, 0.36604073652583824,
        0.5409162409447797, 0.4544952728318842],
       ...,
       [0.31908131212338653, 0.8209510437184054, 0.5673026744845093,
        0.31960922855815566, 0.13333544626672622],
       [0.38529312644544755, 0.03991969260672901, 0.6191246421021066,
        0.5287174306127735, 0.8290311759624767],
       [0.8745530240849394, 0.4033510139261488, 0.9518709847549672,
        0.7434908910674527, 0.4177802539968498]], dtype=object)

In [65]:
newdf.T  # transpose.....row->col, col->row

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.3,0.66736,0.146307,0.598608,0.77826,0.789771,0.13426,0.686826,0.513958,0.31307,...,0.0663456,0.82232,0.549749,0.358605,0.845337,0.498871,0.303543,0.319081,0.385293,0.874553
1,0.714596,0.285382,0.537367,0.156227,0.509021,0.0695491,0.897977,0.906348,0.601832,0.172416,...,0.96157,0.0211923,0.0929021,0.502854,0.450841,0.617681,0.209804,0.820951,0.0399197,0.403351
2,0.115251,0.320376,0.366041,0.214438,0.821528,0.938104,0.923108,0.486378,0.347358,0.712145,...,0.923651,0.650451,0.517624,0.639945,0.308892,0.788718,0.286465,0.567303,0.619125,0.951871
3,0.96628,0.749366,0.540916,0.871918,0.373929,0.0979537,0.137595,0.0589126,0.902805,0.38063,...,0.877208,0.708328,0.995137,0.482893,0.614412,0.482554,0.175144,0.319609,0.528717,0.743491
4,0.119836,0.00323948,0.454495,0.431849,0.900429,0.221177,0.817225,0.332584,0.276307,0.884452,...,0.899748,0.372134,0.433934,0.38851,0.0595115,0.982107,0.751455,0.133335,0.829031,0.41778

In [67]:
newdf.head()

          0         1         2         3         4
0       0.3  0.714596  0.115251  0.966280  0.119836
1   0.66736  0.285382  0.320376  0.749366  0.003239
2  0.146307  0.537367  0.366041  0.540916  0.454495
3  0.598608  0.156227  0.214438  0.871918  0.431849
4   0.77826  0.509021  0.821528  0.373929  0.900429

In [68]:
newdf.sort_index(axis=0,ascending=False)
# axis 0 -> row
# axis 1 -> col
# default ascending-> true

            0         1         2         3         4
333  0.874553  0.403351  0.951871  0.743491  0.417780
332  0.385293  0.039920  0.619125  0.528717  0.829031
331  0.319081  0.820951  0.567303  0.319609  0.133335
330  0.303543  0.209804  0.286465  0.175144  0.751455
329  0.498871  0.617681  0.788718  0.482554  0.982107
..        ...       ...       ...       ...       ...
4     0.77826  0.509021  0.821528  0.373929  0.900429
3    0.598608  0.156227  0.214438  0.871918  0.431849
2    0.146307  0.537367  0.366041  0.540916  0.454495
1     0.66736  0.285382  0.320376  0.749366  0.003239
0         0.3  0.714596  0.115251  0.966280  0.119836

[334 rows x 5 columns]

In [69]:
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.119836  0.966280  0.115251  0.714596       0.3
1    0.003239  0.749366  0.320376  0.285382   0.66736
2    0.454495  0.540916  0.366041  0.537367  0.146307
3    0.431849  0.871918  0.214438  0.156227  0.598608
4    0.900429  0.373929  0.821528  0.509021   0.77826
..        ...       ...       ...       ...       ...
329  0.982107  0.482554  0.788718  0.617681  0.498871
330  0.751455  0.175144  0.286465  0.209804  0.303543
331  0.133335  0.319609  0.567303  0.820951  0.319081
332  0.829031  0.528717  0.619125  0.039920  0.385293
333  0.417780  0.743491  0.951871  0.403351  0.874553

[334 rows x 5 columns]

In [71]:
newdf.sort_values(by=0,ascending=False) # col

              0         1         2         3         4
175    0.996798  0.354716  0.460859  0.645259  0.967648
273    0.996068  0.889390  0.491528  0.563994  0.218213
269    0.994633  0.066263  0.091870  0.557310  0.540497
158    0.994213  0.482360  0.150163  0.271737  0.349904
188    0.986169  0.447574  0.394663  0.543274  0.130225
..          ...       ...       ...       ...       ...
60    0.0120036  0.717380  0.060279  0.717871  0.417869
153   0.0081828  0.407430  0.417086  0.221807  0.854836
239  0.00439773  0.635357  0.961626  0.141243  0.909396
274  0.00218652  0.183616  0.381341  0.544192  0.121072
250  0.00137493  0.734353  0.124435  0.264586  0.833530

[334 rows x 5 columns]

In [72]:
newdf.head()

          0         1         2         3         4
0       0.3  0.714596  0.115251  0.966280  0.119836
1   0.66736  0.285382  0.320376  0.749366  0.003239
2  0.146307  0.537367  0.366041  0.540916  0.454495
3  0.598608  0.156227  0.214438  0.871918  0.431849
4   0.77826  0.509021  0.821528  0.373929  0.900429

In [73]:
newdf[0]

0           0.3
1       0.66736
2      0.146307
3      0.598608
4       0.77826
         ...
329    0.498871
330    0.303543
331    0.319081
332    0.385293
333    0.874553
Name: 0, Length: 334, dtype: object

In [74]:
type(newdf[0])

pandas.core.series.Series

###  View and Copy

In [75]:
newdf2 = newdf

In [76]:
newdf2 # view of the original
# change value of original df

            0         1         2         3         4
0         0.3  0.714596  0.115251  0.966280  0.119836
1     0.66736  0.285382  0.320376  0.749366  0.003239
2    0.146307  0.537367  0.366041  0.540916  0.454495
3    0.598608  0.156227  0.214438  0.871918  0.431849
4     0.77826  0.509021  0.821528  0.373929  0.900429
..        ...       ...       ...       ...       ...
329  0.498871  0.617681  0.788718  0.482554  0.982107
330  0.303543  0.209804  0.286465  0.175144  0.751455
331  0.319081  0.820951  0.567303  0.319609  0.133335
332  0.385293  0.039920  0.619125  0.528717  0.829031
333  0.874553  0.403351  0.951871  0.743491  0.417780

[334 rows x 5 columns]

In [77]:
newdf2[0][0]=675

<ipython-input-77-4270847a272b>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0]=675

In [78]:
newdf2.head(2)

         0         1         2         3         4
0      675  0.714596  0.115251  0.966280  0.119836
1  0.66736  0.285382  0.320376  0.749366  0.003239

In [79]:
newdf.head(2) # original also changed

         0         1         2         3         4
0      675  0.714596  0.115251  0.966280  0.119836
1  0.66736  0.285382  0.320376  0.749366  0.003239

In [80]:
newdf3= newdf[:] #copy

In [81]:
newdf4 = newdf.copy() # copy

In [82]:
newdf4[0][0]=879

<ipython-input-82-3b54f1719faa>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf4[0][0]=879

In [83]:
newdf4.head(2)

         0         1         2         3         4
0      879  0.714596  0.115251  0.966280  0.119836
1  0.66736  0.285382  0.320376  0.749366  0.003239

In [84]:
newdf.head(2) # original value doesnt change

         0         1         2         3         4
0      675  0.714596  0.115251  0.966280  0.119836
1  0.66736  0.285382  0.320376  0.749366  0.003239

###  loc , iloc

#####  To set any value in DF

In [102]:
newdf4.loc[0,0]=543  # row,col

In [103]:
newdf4.head(2)

         0         1         2         3         4
0      543  0.714596  0.115251  0.966280  0.119836
1  0.66736  0.285382  0.320376  0.749366  0.003239

In [105]:
newdf4.columns=list('ABCDE')

In [106]:
newdf4.head(2)

         A         B         C         D         E
0      543  0.714596  0.115251  0.966280  0.119836
1  0.66736  0.285382  0.320376  0.749366  0.003239

In [107]:
newdf4.columns=['F','G','H','I','j']

In [108]:
newdf4.head(2)

         F         G         H         I         j
0      543  0.714596  0.115251  0.966280  0.119836
1  0.66736  0.285382  0.320376  0.749366  0.003239

In [109]:
newdf4.columns=list('ABCDE')

In [110]:
newdf4.loc[0,0]=100

In [111]:
newdf4.head()

          A         B         C         D         E      0
0       543  0.714596  0.115251  0.966280  0.119836  100.0
1   0.66736  0.285382  0.320376  0.749366  0.003239    NaN
2  0.146307  0.537367  0.366041  0.540916  0.454495    NaN
3  0.598608  0.156227  0.214438  0.871918  0.431849    NaN
4   0.77826  0.509021  0.821528  0.373929  0.900429    NaN

In [112]:
newdf4.loc[0,'A']= 9782

In [113]:
newdf4.head()

          A         B         C         D         E      0
0      9782  0.714596  0.115251  0.966280  0.119836  100.0
1   0.66736  0.285382  0.320376  0.749366  0.003239    NaN
2  0.146307  0.537367  0.366041  0.540916  0.454495    NaN
3  0.598608  0.156227  0.214438  0.871918  0.431849    NaN
4   0.77826  0.509021  0.821528  0.373929  0.900429    NaN

In [115]:
newdf5 = newdf4.drop(0,axis=1)

In [117]:
newdf5.head()

          A         B         C         D         E
0      9782  0.714596  0.115251  0.966280  0.119836
1   0.66736  0.285382  0.320376  0.749366  0.003239
2  0.146307  0.537367  0.366041  0.540916  0.454495
3  0.598608  0.156227  0.214438  0.871918  0.431849
4   0.77826  0.509021  0.821528  0.373929  0.900429

In [118]:
newdf5.loc[[1,2],['C','D']] # row col

          C         D
1  0.320376  0.749366
2  0.366041  0.540916

In [120]:
newdf5.loc[:,['C','D']]

            C         D
0    0.115251  0.966280
1    0.320376  0.749366
2    0.366041  0.540916
3    0.214438  0.871918
4    0.821528  0.373929
..        ...       ...
329  0.788718  0.482554
330  0.286465  0.175144
331  0.567303  0.319609
332  0.619125  0.528717
333  0.951871  0.743491

[334 rows x 2 columns]

In [121]:
newdf5.loc[[3,4,5],:]

          A         B         C         D         E
3  0.598608  0.156227  0.214438  0.871918  0.431849
4   0.77826  0.509021  0.821528  0.373929  0.900429
5  0.789771  0.069549  0.938104  0.097954  0.221177

In [123]:
newdf5.loc[(newdf5['A']<0.3)] #query

             A         B         C         D         E
2     0.146307  0.537367  0.366041  0.540916  0.454495
6      0.13426  0.897977  0.923108  0.137595  0.817225
10    0.256361  0.657938  0.739521  0.143378  0.935397
28     0.19079  0.434170  0.447295  0.140469  0.208399
36    0.295134  0.908694  0.456515  0.345148  0.940484
..         ...       ...       ...       ...       ...
310    0.13299  0.317672  0.335391  0.985260  0.611501
314   0.138857  0.656644  0.501835  0.834612  0.757583
321   0.279239  0.290600  0.937614  0.792004  0.837872
323  0.0164343  0.663593  0.734717  0.547795  0.429391
324  0.0663456  0.961570  0.923651  0.877208  0.899748

[90 rows x 5 columns]

In [126]:
newdf5.loc[(newdf5['A']>0.3) & (newdf5['C']<0.5)] # more complex query

            A         B         C         D         E
0        9782  0.714596  0.115251  0.966280  0.119836
1     0.66736  0.285382  0.320376  0.749366  0.003239
3    0.598608  0.156227  0.214438  0.871918  0.431849
7    0.686826  0.906348  0.486378  0.058913  0.332584
8    0.513958  0.601832  0.347358  0.902805  0.276307
..        ...       ...       ...       ...       ...
316  0.458959  0.565413  0.150553  0.988117  0.758697
318  0.703288  0.018954  0.085343  0.187909  0.734464
320  0.569229  0.925196  0.101381  0.212720  0.360817
328  0.845337  0.450841  0.308892  0.614412  0.059512
330  0.303543  0.209804  0.286465  0.175144  0.751455

[129 rows x 5 columns]

In [ ]:
# loc -> select row/column using row/col names

In [ ]:
# iloc -> select based on index values despite the names

In [127]:
newdf5.head(2)

         A         B         C         D         E
0     9782  0.714596  0.115251  0.966280  0.119836
1  0.66736  0.285382  0.320376  0.749366  0.003239

In [128]:
newdf5.iloc[0,4] # row 0, column 4 value

0.1198363754644417

In [130]:
newdf5.iloc[[0,5,9],[1,2,4]] # row, col

          B         C         E
0  0.714596  0.115251  0.119836
5  0.069549  0.938104  0.221177
9  0.172416  0.712145  0.884452

In [131]:
newdf5.head(3)

          A         B         C         D         E
0      9782  0.714596  0.115251  0.966280  0.119836
1   0.66736  0.285382  0.320376  0.749366  0.003239
2  0.146307  0.537367  0.366041  0.540916  0.454495

In [132]:
newdf5.drop([0]) # drop row

            A         B         C         D         E
1     0.66736  0.285382  0.320376  0.749366  0.003239
2    0.146307  0.537367  0.366041  0.540916  0.454495
3    0.598608  0.156227  0.214438  0.871918  0.431849
4     0.77826  0.509021  0.821528  0.373929  0.900429
5    0.789771  0.069549  0.938104  0.097954  0.221177
..        ...       ...       ...       ...       ...
329  0.498871  0.617681  0.788718  0.482554  0.982107
330  0.303543  0.209804  0.286465  0.175144  0.751455
331  0.319081  0.820951  0.567303  0.319609  0.133335
332  0.385293  0.039920  0.619125  0.528717  0.829031
333  0.874553  0.403351  0.951871  0.743491  0.417780

[333 rows x 5 columns]

In [134]:
newdf5.drop(['A','D'],axis=1)

            B         C         E
0    0.714596  0.115251  0.119836
1    0.285382  0.320376  0.003239
2    0.537367  0.366041  0.454495
3    0.156227  0.214438  0.431849
4    0.509021  0.821528  0.900429
..        ...       ...       ...
329  0.617681  0.788718  0.982107
330  0.209804  0.286465  0.751455
331  0.820951  0.567303  0.133335
332  0.039920  0.619125  0.829031
333  0.403351  0.951871  0.417780

[334 rows x 3 columns]

In [135]:
newdf5.head() # original not changed...to change we have to assign

          A         B         C         D         E
0      9782  0.714596  0.115251  0.966280  0.119836
1   0.66736  0.285382  0.320376  0.749366  0.003239
2  0.146307  0.537367  0.366041  0.540916  0.454495
3  0.598608  0.156227  0.214438  0.871918  0.431849
4   0.77826  0.509021  0.821528  0.373929  0.900429

In [136]:
newdf5.drop(['A','D'],axis=1, inplace=True)
# inplace-> True : original will be modified

In [137]:
newdf5.head()

          B         C         E
0  0.714596  0.115251  0.119836
1  0.285382  0.320376  0.003239
2  0.537367  0.366041  0.454495
3  0.156227  0.214438  0.431849
4  0.509021  0.821528  0.900429

In [138]:
newdf5.drop([1,5],axis=0, inplace=True)

In [139]:
newdf5.head()

          B         C         E
0  0.714596  0.115251  0.119836
2  0.537367  0.366041  0.454495
3  0.156227  0.214438  0.431849
4  0.509021  0.821528  0.900429
6  0.897977  0.923108  0.817225

In [140]:
newdf5.reset_index()

     index         B         C         E
0        0  0.714596  0.115251  0.119836
1        2  0.537367  0.366041  0.454495
2        3  0.156227  0.214438  0.431849
3        4  0.509021  0.821528  0.900429
4        6  0.897977  0.923108  0.817225
..     ...       ...       ...       ...
327    329  0.617681  0.788718  0.982107
328    330  0.209804  0.286465  0.751455
329    331  0.820951  0.567303  0.133335
330    332  0.039920  0.619125  0.829031
331    333  0.403351  0.951871  0.417780

[332 rows x 4 columns]

In [143]:
newdf5.reset_index(drop=True, inplace = True)

In [145]:
newdf5.head()

          B         C         E
0  0.714596  0.115251  0.119836
1  0.537367  0.366041  0.454495
2  0.156227  0.214438  0.431849
3  0.509021  0.821528  0.900429
4  0.897977  0.923108  0.817225

In [146]:
newdf5['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [148]:
newdf5.isnull()

         B      C      E
0    False  False  False
1    False  False  False
2    False  False  False
3    False  False  False
4    False  False  False
..     ...    ...    ...
327  False  False  False
328  False  False  False
329  False  False  False
330  False  False  False
331  False  False  False

[332 rows x 3 columns]

In [149]:
newdf5['B']=None

In [151]:
newdf5

        B         C         E
0    None  0.115251  0.119836
1    None  0.366041  0.454495
2    None  0.214438  0.431849
3    None  0.821528  0.900429
4    None  0.923108  0.817225
..    ...       ...       ...
327  None  0.788718  0.982107
328  None  0.286465  0.751455
329  None  0.567303  0.133335
330  None  0.619125  0.829031
331  None  0.951871  0.417780

[332 rows x 3 columns]

In [157]:
newdf5['B']=np.nan

In [163]:
newdf5

      B         C         E
0   NaN  0.115251  0.119836
1   NaN  0.366041  0.454495
2   NaN  0.214438  0.431849
3   NaN  0.821528  0.900429
4   NaN  0.923108  0.817225
..   ..       ...       ...
327 NaN  0.788718  0.982107
328 NaN  0.286465  0.751455
329 NaN  0.567303  0.133335
330 NaN  0.619125  0.829031
331 NaN  0.951871  0.417780

[332 rows x 3 columns]

In [164]:
newdf5['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
327    True
328    True
329    True
330    True
331    True
Name: B, Length: 332, dtype: bool

In [165]:
# but to set value use loc
newdf5.loc[:,['B']]=np.nan

In [166]:
newdf5

      B         C         E
0   NaN  0.115251  0.119836
1   NaN  0.366041  0.454495
2   NaN  0.214438  0.431849
3   NaN  0.821528  0.900429
4   NaN  0.923108  0.817225
..   ..       ...       ...
327 NaN  0.788718  0.982107
328 NaN  0.286465  0.751455
329 NaN  0.567303  0.133335
330 NaN  0.619125  0.829031
331 NaN  0.951871  0.417780

[332 rows x 3 columns]

In [167]:
newdf5['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
327    True
328    True
329    True
330    True
331    True
Name: B, Length: 332, dtype: bool

In [168]:
df =  pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [169]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [170]:
df.dropna() # remove null

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [171]:
df.dropna(how="all") # dont drop unless all null row

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [172]:
df.dropna(how='any') # drop if any null

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [173]:
df =  pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, np.nan, np.nan],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [174]:
df

       name  toy       born
0    Alfred  NaN        NaT
1    Batman  NaN 1940-04-25
2  Catwoman  NaN        NaT

In [175]:
df.dropna(how='all',axis=1) # col

       name       born
0    Alfred        NaT
1    Batman 1940-04-25
2  Catwoman        NaT

In [176]:
df =  pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [177]:
df

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [180]:
df.drop_duplicates(subset=['name'])

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25

In [181]:
df.drop_duplicates(subset=['name'],keep='last')

     name        toy       born
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [182]:
df.drop_duplicates(subset='name',keep=False)

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [189]:
df =  pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [190]:
df

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [191]:
df.fillna(value=2,inplace=True)

In [192]:
df

     name        toy                 born
0  Alfred          2                    2
1  Batman  Batmobile  1940-04-25 00:00:00
2  Alfred   Bullwhip                    2

In [193]:
df =  pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [195]:
df.shape

(3, 3)

In [196]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [198]:
df

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [197]:
df['name'].value_counts(dropna=False)

Alfred    2
Batman    1
Name: name, dtype: int64

In [199]:
df['toy'].value_counts(dropna=False)

Batmobile    1
Bullwhip     1
NaN          1
Name: toy, dtype: int64

In [200]:
df['toy'].value_counts(dropna=True)

Batmobile    1
Bullwhip     1
Name: toy, dtype: int64

In [201]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [202]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

In [ ]:
# create df of integer nums with 3 row and 2 cols

In [205]:
df= pd.DataFrame(np.random.randint(0,100,size=(3,2)))

In [206]:
df

    0   1
0  88  77
1  29  71
2  59  40

In [207]:
df.describe()

               0          1
count   3.000000   3.000000
mean   58.666667  62.666667
std    29.501412  19.857828
min    29.000000  40.000000
25%    44.000000  55.500000
50%    59.000000  71.000000
75%    73.500000  74.000000
max    88.000000  77.000000

In [208]:
df.mean()

0    58.666667
1    62.666667
dtype: float64

In [209]:
df.min()

0    29
1    40
dtype: int32

In [210]:
df.max()

0    88
1    77
dtype: int32

In [211]:
df.count()

0    3
1    3
dtype: int64

In [212]:
df.median()

0    59.0
1    71.0
dtype: float64

In [213]:
df.std()

0    29.501412
1    19.857828
dtype: float64

In [214]:
df.corr()

          0         1
0  1.000000  0.141394
1  0.141394  1.000000

### Excel

In [215]:
data= pd.read_excel('data.xlsx')

In [216]:
data # read sheet 1 from data exel file which contains sheet1 and sheet2

   Train number  Speed      City
0          8721     58   Barisal
1           589     34     dhaka
2          2862     56  rajshahi
3          8230     78   comilla

In [217]:
data=pd.read_excel('data.xlsx', sheet_name='Sheet2')

In [218]:
data

   Train number S2  Speed S2   City S2
0             8721        58   Barisal
1             4752        56     dhaka
2             2862        98  rajshahi
3             3654        70   comilla

In [219]:
# write

In [221]:
data.iloc[0,1]=67

In [222]:
data

   Train number S2  Speed S2   City S2
0             8721        67   Barisal
1             4752        56     dhaka
2             2862        98  rajshahi
3             3654        70   comilla

In [224]:
data.to_excel('data.xlsx',sheet_name='Sheet3')

In [225]:
data=pd.read_excel('data.xlsx',sheet_name='Sheet3')

In [226]:
data

   Unnamed: 0  Train number S2  Speed S2   City S2
0           0             8721        67   Barisal
1           1             4752        56     dhaka
2           2             2862        98  rajshahi
3           3             3654        70   comilla

In [ ]:
# try again

In [232]:
data1= pd.read_excel('data_append.xlsx')

In [233]:
data1

   Train number s2  Speed s2   City s2
0             8721        89   Barisal
1              589        25     dhaka
2             2862        41  rajshahi
3             8230        63   comilla

In [238]:
data2=pd.read_excel('data_append.xlsx', sheet_name='Sheet1')

In [239]:
data2

   Train number s1  Speed s1   City s1
0             8721        58   Barisal
1              589        34     dhaka
2             2862        56  rajshahi
3             8230        78   comilla

In [240]:
data2.iloc[0,1]=29

In [241]:
data2

   Train number s1  Speed s1   City s1
0             8721        29   Barisal
1              589        34     dhaka
2             2862        56  rajshahi
3             8230        78   comilla

In [246]:
with pd.ExcelWriter('data_append.xlsx',
                    mode='a', engine="openpyxl") as writer:  
    data2.to_excel(writer, sheet_name='Sheet3')

In [ ]:
# append sheet 3 with sheet 1 and 2 in data_append.xlsx file
#otherwise sheet1 and 2 will be lost